In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\programdata\anaconda3\lib\site-packages (3.2.0)
Requirement already satisfied: py4j==0.10.9.2 in c:\programdata\anaconda3\lib\site-packages (from pyspark) (0.10.9.2)

In [2]:
import pyspark

In [3]:
from pyspark.sql import SparkSession

In [4]:
spark=SparkSession.builder.appName('Dataframe').getOrCreate()

In [5]:
spark

In [24]:
# reading the data set
df_pyspark=spark.read.option('header','true').csv('test1.csv',inferSchema=True)

In [10]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [11]:
df_pyspark.show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Mahesh| 31|        10| 30000|
|   Raju| 30|         8| 25000|
|  Pooja| 29|         4| 20000|
|  Parul| 24|         3| 20000|
|  Shiva| 21|         1| 15000|
|Kshitij| 23|         2| 18000|
+-------+---+----------+------+

In [12]:
#List the column
df_pyspark.columns

['Name', 'age', 'Experience', 'Salary']

In [13]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [15]:
df_pyspark.head(3)

[Row(Name='Mahesh', age=31, Experience=10, Salary=30000),
 Row(Name='Raju', age=30, Experience=8, Salary=25000),
 Row(Name='Pooja', age=29, Experience=4, Salary=20000)]

In [16]:
df_pyspark.show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Mahesh| 31|        10| 30000|
|   Raju| 30|         8| 25000|
|  Pooja| 29|         4| 20000|
|  Parul| 24|         3| 20000|
|  Shiva| 21|         1| 15000|
|Kshitij| 23|         2| 18000|
+-------+---+----------+------+

In [18]:
df_pyspark.select(['Name','age','Salary']).show()

+-------+---+------+
|   Name|age|Salary|
+-------+---+------+
| Mahesh| 31| 30000|
|   Raju| 30| 25000|
|  Pooja| 29| 20000|
|  Parul| 24| 20000|
|  Shiva| 21| 15000|
|Kshitij| 23| 18000|
+-------+---+------+

In [19]:
df_pyspark.dtypes

[('Name', 'string'), ('age', 'int'), ('Experience', 'int'), ('Salary', 'int')]

In [20]:
df_pyspark.describe().show()

+-------+-------+------------------+-----------------+------------------+
|summary|   Name|               age|       Experience|            Salary|
+-------+-------+------------------+-----------------+------------------+
|  count|      6|                 6|                6|                 6|
|   mean|   null|26.333333333333332|4.666666666666667|21333.333333333332|
| stddev|   null| 4.179314138308661|3.559026084010437| 5354.126134736337|
|    min|Kshitij|                21|                1|             15000|
|    max|  Shiva|                31|               10|             30000|
+-------+-------+------------------+-----------------+------------------+

In [21]:
#Drop the column
df_pyspark=df_pyspark.drop('age').show()

+-------+----------+------+
|   Name|Experience|Salary|
+-------+----------+------+
| Mahesh|        10| 30000|
|   Raju|         8| 25000|
|  Pooja|         4| 20000|
|  Parul|         3| 20000|
|  Shiva|         1| 15000|
|Kshitij|         2| 18000|
+-------+----------+------+

# Adding nwe column

In [25]:
df_pyspark=df_pyspark.withColumn('New Salary',df_pyspark['Salary']+1000)

In [26]:
df_pyspark.show()

+-------+---+----------+------+----------+
|   Name|age|Experience|Salary|New Salary|
+-------+---+----------+------+----------+
| Mahesh| 31|        10| 30000|     31000|
|   Raju| 30|         8| 25000|     26000|
|  Pooja| 29|         4| 20000|     21000|
|  Parul| 24|         3| 20000|     21000|
|  Shiva| 21|         1| 15000|     16000|
|Kshitij| 23|         2| 18000|     19000|
+-------+---+----------+------+----------+

In [27]:
# Renaming 

df_pyspark.withColumnRenamed('Experience','Employee Experience').show()

+-------+---+-------------------+------+----------+
|   Name|age|Employee Experience|Salary|New Salary|
+-------+---+-------------------+------+----------+
| Mahesh| 31|                 10| 30000|     31000|
|   Raju| 30|                  8| 25000|     26000|
|  Pooja| 29|                  4| 20000|     21000|
|  Parul| 24|                  3| 20000|     21000|
|  Shiva| 21|                  1| 15000|     16000|
|Kshitij| 23|                  2| 18000|     19000|
+-------+---+-------------------+------+----------+

In [28]:
df_pyspark=spark.read.csv('test2.csv',header=True,inferSchema=True)

In [31]:
df_pyspark.printSchema()

root
 |-- Name: string (nullable = true)
 |-- age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

In [29]:
df_pyspark.show()

+-------+----+----------+------+
|   Name| age|Experience|Salary|
+-------+----+----------+------+
| Mahesh|  31|        10| 30000|
|   Raju|  30|         8| 25000|
|  Pooja|  29|         4| 20000|
|  Parul|  24|         3| 20000|
|  Shiva|  21|         1| 15000|
|Kshitij|  23|         2| 18000|
|Sourabh|null|      null| 40000|
|   null|  34|        10| 38000|
|   null|  36|      null|  null|
+-------+----+----------+------+

In [32]:
#Dropping Null values
df_pyspark.na.drop().show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Mahesh| 31|        10| 30000|
|   Raju| 30|         8| 25000|
|  Pooja| 29|         4| 20000|
|  Parul| 24|         3| 20000|
|  Shiva| 21|         1| 15000|
|Kshitij| 23|         2| 18000|
+-------+---+----------+------+

In [40]:
### any==how
df_pyspark.na.drop(how='any',thresh=3).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Mahesh| 31|        10| 30000|
|   Raju| 30|         8| 25000|
|  Pooja| 29|         4| 20000|
|  Parul| 24|         3| 20000|
|  Shiva| 21|         1| 15000|
|Kshitij| 23|         2| 18000|
|   null| 34|        10| 38000|
+-------+---+----------+------+

In [41]:
##Subset
df_pyspark.na.drop(how="any",subset=['Age']).show()

+-------+---+----------+------+
|   Name|age|Experience|Salary|
+-------+---+----------+------+
| Mahesh| 31|        10| 30000|
|   Raju| 30|         8| 25000|
|  Pooja| 29|         4| 20000|
|  Parul| 24|         3| 20000|
|  Shiva| 21|         1| 15000|
|Kshitij| 23|         2| 18000|
|   null| 34|        10| 38000|
|   null| 36|      null|  null|
+-------+---+----------+------+